# Brewfile - Declarative package management

# Terminal Environment
brew "yazi"           # File manager
brew "chafa"          # Terminal image previewer (yazi)
brew "resvg"          # SVG renderer (yazi)
brew "lowdown"        # Markdown renderer (yazi preview)
brew "zellij"         # Terminal multiplexer
brew "glow"           # Markdown renderer
brew "helix"          # Text editor (alternative)
brew "neovim"         # Text editor (default)
brew "lazygit"        # Git TUI (LazyVim integration)
brew "lazydocker"     # Docker TUI
brew "micro"          # Text editor (simple)
brew "tmux"           # Terminal multiplexer
brew "btop"           # System/resource monitor
brew "bottom"         # System/resource monitor (flexible layouts)

# CLI Utilities
brew "git"
brew "gh"             # GitHub CLI
brew "ripgrep"        # Fast grep
brew "fd"             # Fast find
brew "fzf"            # Fuzzy finder
brew "zoxide"         # Smart cd with frecency
brew "git-delta"      # Syntax-highlighted diffs
brew "bat"            # Cat with syntax highlighting (delta themes)
brew "jq"             # JSON processor
brew "chrome-cli"     # Browser tab control (Brave via CHROME_BUNDLE_IDENTIFIER)
brew "eza"            # Modern ls
brew "starship"       # Cross-shell prompt
brew "stow"           # Symlink manager

# Development
brew "node"           # For npm packages
brew "rustup-init"    # Rust toolchain manager

# Applications (macOS only)
cask "ghostty" if OS.mac?

# Fonts (macOS only - casks don't work on Linux)
cask "font-jetbrains-mono-nerd-font" if OS.mac?
cask "font-monaspace-nf" if OS.mac?
